<?php
// +----------------------------------------------------------------------
// | HisiPHP框架[基于ThinkPHP5开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2018 http://www.hisiphp.com
// +----------------------------------------------------------------------
// | HisiPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
// +----------------------------------------------------------------------
// | Author: yupaker
// +----------------------------------------------------------------------
/**
 * 模块基本信息
 */
return [
    // 模块名[必填]
    'name'        => 'yupaker',
    // 模块标题[必填]
    'title'       => '博客',
    // 模块唯一标识[必填]，格式：模块名.[应用市场ID].module.[应用市场分支ID]
    'identifier'  => 'yupaker.hisiphp.module',
    // 主题模板[必填]，默认default
    'theme'        => 'default',
    // 模块图标[选填]
    'icon'        => '/static/app_icon/yupaker.png',
    // 模块简介[选填]
    'intro' => '个人博客',
    // 开发者[必填]
    'author'      => 'yupaker',
    // 开发者网址[选填]
    'author_url'  => '',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    // 主版本号【位数变化：1-99】：当模块出现大更新或者很大的改动，比如整体架构发生变化。此版本号会变化。
    // 次版本号【位数变化：0-999】：当模块功能有新增或删除，此版本号会变化，如果仅仅是补充原有功能时，此版本号不变化。
    // 修订版本号【位数变化：0-999】：一般是 Bug 修复或是一些小的变动，功能上没有大的变化，修复一个严重的bug即发布一个修订版。
    'version'     => '1.0.0',
    // 模块依赖[可选]，格式[[模块名, 模块唯一标识, 依赖版本, 对比方式]]
    'module_depend' => [],
    // 插件依赖[可选]，格式[[插件名, 插件唯一标识, 依赖版本, 对比方式]]
    'plugin_depend' => [],
    // 模块数据表[有数据库表时必填,不包含表前缀]
    'tables' => [
        'news',
        'newscategory',
    ],
    // 原始数据库表前缀,模块带sql文件时必须配置
    'db_prefix' => 'yupaker_',
    // 模块预埋钩子[非系统钩子，必须填写]
    'hooks' => [],
    // 模块配置，格式['sort' => '100','title' => '配置标题','name' => '配置名称','type' => '配置类型','options' => '配置选项','value' => '配置默认值', 'tips' => '配置提示'],各参数设置可参考管理后台->系统->系统功能->配置管理->添加
    'config' => [
            [
            'sort' => 100, 
            'title' => '网站名称', 
            'name' => 'SETA_TITLE', 
            'type' => 'input', 
            'options' => '', 
            'value' => '', 
            'tips' => '',
        ], 
        [
            'sort' => 101, 
            'title' => '网站关键词', 
            'name' => 'SETA_KEYWORDS', 
            'type' => 'input', 
            'options' => '', 
            'value' => '', 
            'tips' => '',
        ], 
        [
            'sort' => 102, 
            'title' => '网站描述', 
            'name' => 'SETA_DESCRIPTION', 
            'type' => 'input', 
            'options' => '', 
            'value' => '', 
            'tips' => '',
        ], 
    ],
];